# 버전 확인

In [5]:
import numpy

numpy.__version__

'1.23.5'

In [6]:
import pandas

pandas.__version__

'1.4.4'

In [7]:
import matplotlib

matplotlib.__version__

'3.5.2'

In [8]:
import folium

folium.__version__

'0.16.0'

In [1]:
import sklearn

sklearn.__version__

'1.1.2'

# 패키지 로딩

In [6]:
import numpy as np
import pandas as pd
import glob

import matplotlib.pyplot as plt
import folium

# 데이터 로딩
- 1월 27일 ~ 5월 17일

## 2023년 따릉이 사용량

In [16]:
df_2023 = pd.DataFrame()

for i in range(1, 6):

    all_files = glob.glob(f"./data/일일 따릉이 사용내역/23년/{i}월/*.csv")

    for file in all_files:
        
        try:
            temp = pd.read_csv(file, encoding="utf-8-sig")
            
        except:
            temp = pd.read_csv(file, encoding="cp949")

        try:
            temp = temp[["기준_날짜", "집계 기준", "기준_시간대", "정류소 ID"]]
            temp = temp[temp["집계 기준"] == "도착시간"]
            temp = temp.drop("집계 기준", axis = 1)
            
        except:
            temp = temp[["기준_날짜", "기준_시간대", "시작_대여소_ID"]]
            
        finally:
            temp["기준_날짜"] = pd.to_datetime(temp["기준_날짜"], format='%Y%m%d')

            df_2023 = pd.concat([df_2023, temp], axis = 0)
            
df_2023.sort_values(["기준_날짜", "기준_시간대"]).reset_index(drop=True, inplace = True)

df_2023

## 2024년 따릉이 사용량

In [27]:
df_2024 = pd.DataFrame()

for i in range(1, 6):

    all_files = glob.glob(f"./data/일일 따릉이 사용내역/24년/{i}월/*.csv")

    for file in all_files:
        
        try:
            temp = pd.read_csv(file, encoding="utf-8-sig")
            
        except:
            temp = pd.read_csv(file, encoding="cp949")

        try:
            temp = temp[["기준_날짜", "집계 기준", "기준_시간대", "정류소 ID"]]
            temp = temp[temp["집계 기준"] == "도착시간"]
            temp = temp.drop("집계 기준", axis = 1)
            
        except:
            temp = temp[["기준_날짜", "기준_시간대", "시작_대여소_ID"]]
            
        finally:
            temp["기준_날짜"] = pd.to_datetime(temp["기준_날짜"], format='%Y%m%d')

            df_2024 = pd.concat([df_2024, temp], axis = 0)
            
df_2024.sort_values(["기준_날짜", "기준_시간대"]).reset_index(drop=True, inplace = True)

df_2024

            기준_날짜 기준_시간대 시작_대여소_ID
0      2024-01-07      0   ST-1004
1      2024-01-07      0   ST-1014
2      2024-01-07      0   ST-1036
3      2024-01-07      0   ST-1047
4      2024-01-07      0   ST-1065
...           ...    ...       ...
353354 2024-04-30   2355     ST-95
353355 2024-04-30   2355    ST-964
353356 2024-04-30   2355    ST-972
353357 2024-04-30   2355     ST-99
353358 2024-04-30   2355     ST-99

[21894962 rows x 3 columns]

## 서울시 따릉이대여소 위치정보

In [3]:
pd.read_csv("./data/서울시 따릉이대여소 마스터 정보.csv", encoding="cp949")

       대여소_ID                      주소1            주소2         위도          경도
0      ST-999       서울특별시 양천구 목동서로 280  목동아파트 8단지 상가동   0.000000    0.000000
1      ST-998       서울특별시 양천구 목동서로 130  목동아파트 4단지 상가동   0.000000    0.000000
2      ST-997       서울특별시 양천구 목동중앙로 49  목동3단지 시내버스정류장  37.534390  126.869598
3      ST-996   서울특별시 양천구 남부순환로88길5-16     양강중학교앞 교차로  37.524334  126.850548
4      ST-995  서울특별시 양천구 중앙로 153 공중화장실            NaN  37.510597  126.857323
...       ...                      ...            ...        ...         ...
3281  ST-1002     서울특별시 양천구 목동동로 316-6   서울시 도로환경관리센터  37.529900  126.876541
3282  ST-1001      서울특별시 양천구 남부순환로4길20        서서울호수공원   0.000000    0.000000
3283  ST-1000        서울특별시 양천구 신정동 236    서부식자재마트 건너편  37.510380  126.866798
3284   ST-100       서울특별시 광진구 아차산로 262    더샵스타시티 C동 앞  37.536667  127.073593
3285    ST-10         서울특별시 마포구 양화로 93            427  37.552746  126.918617

[3286 rows x 5 columns]

## 2023년 4월 주민등록인구

In [ ]:
pd.read_csv("./data/인구 데이터/2023년_4월_주민등록인구.csv", encoding="cp949")

## 2024년 4월 주민등록인구

In [4]:
pd.read_csv("./data/인구 데이터/2024년_4월_주민등록인구.csv", encoding="cp949")

     행정구역(시군구)별      연령별  총인구수 (명)  남자인구수 (명)  여자인구수 (명)
0         서울특별시        계   9378269    4532115    4846154
1         서울특별시       0세     37255      19191      18064
2         서울특별시       1세     39761      20217      19544
3         서울특별시       2세     42137      21770      20367
4         서울특별시       3세     43140      22008      21132
...         ...      ...       ...        ...        ...
2647        강동구      96세        92         16         76
2648        강동구      97세        81         11         70
2649        강동구      98세        42          7         35
2650        강동구      99세        23          2         21
2651        강동구  100세 이상        82         15         67

[2652 rows x 5 columns]

# 데이터 전처리

## 2023년 따릉이 사용량

### 일별 사용량

In [26]:
df_2023.groupby("기준_날짜")[["시작_대여소_ID"]].count()

            시작_대여소_ID
기준_날짜
2023-01-27      81552
2023-01-28      71780
2023-01-29      75165
2023-01-30     131314
2023-01-31     148634
...               ...
2023-05-13     299063
2023-05-14     285865
2023-05-15     368610
2023-05-16     370395
2023-05-17     373838

[111 rows x 1 columns]